modules/jome-vinted.org
#+TITLE: My vinted-mac config
#+OPTIONS: toc:2 num:nil ^:nil

* Vinted-mode
  :PROPERTIES:
  :CUSTOM_ID: vinted
  :END:

A place for annoying tilde files.


#+NAME: tilde-files
#+BEGIN_SRC emacs-lisp
(if (file-directory-p "~/emacs/backup")
    (setq backup-directory-alist '(("." . "~/emacs/backup")))
  (message "Directory does not exist: ~/emacs/backup"))
#+END_SRC

Make enviroment variables the same as in termonal.

#+NAME: vinted
#+BEGIN_SRC emacs-lisp
(defun ome-exec-path-from-shell-setup()
  (when (memq window-system '(mac ns))
    (exec-path-from-shell-initialize)))

(ome-install 'exec-path-from-shell)
#+END_SRC

Make sure cut/paste works properly. Gotten from:
http://mindlev.wordpress.com/2011/06/13/emacs-in-a-terminal-on-osx/#comment-20
#+NAME: vinted
#+BEGIN_SRC emacs-lisp
(when (eq system-type 'darwin)
  (unless (display-graphic-p)
    (defun copy-from-osx ()
      "Copies the current clipboard content using the `pbcopy` command"
      (shell-command-to-string "pbpaste"))

    (defun paste-to-osx (text &optional push)
      "Copies the top of the kill ring stack to the OSX clipboard"
      (let ((process-connection-type nil))
        (let ((proc (start-process "pbcopy" "*Messages*" "pbcopy")))
          (process-send-string proc text)
          (process-send-eof proc))))

    ;; Override defaults to use the mac copy and paste
    (setq interprogram-cut-function 'paste-to-osx)
    (setq interprogram-paste-function 'copy-from-osx)))
#+END_SRC

ESS specific paths.

#+NAME: vinted
#+BEGIN_SRC emacs-lisp
  (setq inferior-julia-program-name "/Users/jarutis/dev/julia/usr/bin/julia-basic")
  (setq inferior-R-program-name "/usr/local/bin/R")
#+END_SRC
